Autodesk.Revit.DB.RoutingConditions.GetConditionAt(System.Int32)
Gets the routing condition at the specified index position.
index:
The 0-based index to access the collection of available conditions. The method throws the exception ArgumentOutOfRangeException if the index is out of range.
Returns:
The found routing condition.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not within the valid range of available conditions.
Since:
2013

Autodesk.Revit.DB.RoutingConditions.AppendCondition(Autodesk.Revit.DB.RoutingCondition)
Appends a routing condition to the end of existing routing conditions. Note that the first item (indexed at 0) is the condition for the primary connector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.RoutingConditions.Clear
Clear all existing conditions
Since:
2013

Autodesk.Revit.DB.RoutingConditions.PreferredJunctionType
The junction type (Tee or Tap) to select if defined fittings of both junction types meet all routing conditions.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.RoutingConditions.ErrorLevel
The error level that the routing preference manager should post errors if the routing conditions do not meet any routing preference rule, could be None, Warning, or Error
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013